# Reading writing csv, excel files

# Topics
1. Read CSV file
2. Write CSV file
3. Read excel
4. Write Excel file

# Read CSV file

In [13]:
import pandas as pd

In [14]:
df=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/new.csv')

In [15]:
df

  tickers price
0   GOOGL   845
1     WMT    65
2    MSFT    64
3    RIL   1023
4    TATA  n.a.

In [16]:
stock=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/stock_data.csv')

In [17]:
stock

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [18]:
stock1=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/stock_data.csv',skiprows=1)

In [19]:
stock1

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [20]:
stock2=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/stock_data.csv',nrows=3)

In [21]:
stock2

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [22]:
stock

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [23]:
stock3=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/stock_data.csv'
                 , na_values=["not available","n.a."])

In [24]:
stock3

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

If we put -1 in na_values then we get all the value of -1 present in table
as the NaN value , but it can be dangrous for the data , as some value can 
be a negative number , so we use dictonary for this , not a list for this.

In [25]:
stock4=pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/pandas/4_read_write_to_excel/stock_data.csv'
                 , na_values={
                     'eps':["not available","n.a."],
                     'revenue':["not available","n.a.",-1],
                     'people':["not available","n.a."]
                 })

In [26]:
stock4

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# Wite CSV file

In [29]:
stock4.to_csv('avnishTrade.csv',index=False) # 2ithout index

In [28]:
stock4.to_csv('avnish.csv') # with index

In [30]:
stock4.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [33]:
stock4.to_csv('avnishTrade.csv',index=False,columns=['eps','revenue'])

In [32]:
stock4

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

# Read Excel File

In [35]:
import pandas as pand

In [36]:
stock_data=pand.read_excel("stock_data.xlsx")

In [37]:
stock_data

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [38]:
def conver_people(val):
    if val=='n.a.':
        return "Avnish"
    return val

In [39]:
stock_data1=pand.read_excel("stock_data.xlsx",converters={
    'people':conver_people
})

In [40]:
stock_data1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65         Avnish
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [43]:
def convert_eps(val):
    if val=="not available":
        return None
    return val

In [44]:
stock_data1=pand.read_excel("stock_data.xlsx",converters={
    'people':conver_people,
    'eps':convert_eps
})

In [45]:
stock_data1

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65         Avnish
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

# Write Excel File

In [47]:
stock_data1.to_excel("new_data.xlsx")

# writting the data in the two Different sheet of the Excel sheet

In [60]:
df_stocks = pand.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

In [61]:
df_weather =  pand.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [62]:
df_study=pand.DataFrame({
    'date': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017'],
    'day':['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'],
    'cost':[10,20,30,40,50]
})

In [63]:
df_study

       date        day  cost
0  1/1/2017     Monday    10
1  1/2/2017    Tuesday    20
2  1/3/2017  Wednesday    30
3  1/4/2017   Thursday    40
4  1/5/2017     Friday    50

In [64]:
with pand.ExcelWriter('stocks_weather.xlsx') as writer:
    df_study.to_excel(writer, sheet_name="STUDY")
    df_stocks.to_excel(writer, sheet_name="stocking")
    df_weather.to_excel(writer, sheet_name="weathering")